Repository: IMD246/ChatAppClientSocket
Catalog: lib/l10n/intl_*.arb
Languages: vi

# welcome
source: Welcome To Chat App For Ours
vi: Chào Mừng Tới Ứng Dụng Chat Của Chúng Ta

source: Don't have account!
vi: Không có tài khoản!

source: Sign Up
vi: Đăng ký

source: Forgot Password
vi: Quên mật khẩu

source: Or Sign In
vi: Hoặc đăng nhập

source: Type Your First Name
vi: Nhập Tên Của Bạn

source: Type Your Last Name
vi: Nhập Họ Của Bạn

source: Type Your Email
vi: Nhập Email

source: Type Your Password
vi: Nhập Mật Khẩu

source: Already have an account!
vi: Đã có tài khoản!

source: Sign In
vi: Đăng Nhập

source: Send Email
vi: Gửi Email

# already_remember_passsword
source: Already remember password!
vi: Đã nhớ mật khẩu!

source: User not found in database error
vi: Lỗi không tìm thấy người dùng

source: User not found in database
vi: Không tìm thấy người dùng

source: Email already in use error
vi: Lỗi email đã sử dụng

source: Email already in use
vi: Email đã sử dụng

# wrong_password_error
source: Wrong pasword error
vi: Lỗi sai mật khẩu

source: Wrong password
vi: Sai mật khẩu

source: Generic error
vi: Lỗi chung

source: Auth Error
vi: Lỗi quyền

source: Verification Email Error
vi: Lỗi xác thực email

source: Reset password dialog
vi: Hộp thoại đặt lại mật khẩu

# check_your_email_to_verification
source: Check your gmail {gmailAddress} to verification
vi: Kiểm tra thư {gmailAddress} của bạn để xác thực

# check_your_email_to_reset_password
source: Check your gmail {gmailAddress} to reset password
vi: Kiểm tra thư {gmailAddress} của bạn để đặt lại mật khẩu

source: User doesn't logged in error
vi: lỗi người dùng không đăng nhập

source: user doesn't logged in
vi: người dùng không đăng nhập

source: to_reset_password
vi: để đặt lại mật khẩu

source: Enter Your First Name
vi: Nhập họ của bạn

source: Enter Your Last Name
vi: Nhập tên của bạn

source: Enter Your Email
vi: Nhập email của bạn

source: Enter Your Password
vi: Nhập mật khẩu của bạn

source: Check format your email
vi: kiểm tra định dạng email của bạn

# check_your_email_address_length
source: Your email address length >=6 and <=30
vi: Địa chỉ email >=6 và <=30

source: Weak password
vi: Mật khẩu yếu

# your_password_is_not_duplicate
source: Your password is not duplicate, Check Again!
vi: Mật khẩu không trùng, kiểm tra lại!

# check_your_first_name_length
source: Your First Name Length Need To > 3
vi: Độ dài họ của bạn cần > 3

# check_your_last_name_length
source: Your Last Name Length Need To > 3
vi: Độ dài tên của bạn cần > 3

source: Chat
vi: Đoạn chat

source: Contacts
vi: Liên lạc

source: Recent Message
vi: Đoạn chat hiện tại

source: Active
vi: Hoạt động

source: Don't have any chat
vi: Không có bất kỳ đoạn chat nào

source: Please wait a moment
vi: Làm ơn đợi trong giây lát

source: Only You
vi: Chỉ có bạn

source: Let make some friend and chat
vi: Hãy kiếm bạn và chat

source: Recent Friend
vi: Bạn hiện tại

source: Request Friend
vi: Bạn yêu cầu

source: Accept
vi: Chấp nhận

source: Cancel
vi: Hủy

# no_friend_available
source: No any friend
vi: Không có bất kỳ người bạn nào

# no_request_friend_available
source: No any request friend
vi: Không có bất kỳ yêu cầu kết bạn nào

source: No file selected
vi: Không có file nào được chọn

source: Update User Profile Failed
vi: Cập nhật hồ sơ thất bại!

source: Update Password
vi: Cập nhật mật khẩu

source: Sign Out
vi: Đăng xuất

source: Dark Mode
vi: Chế độ tối

source: Update User Profile successfully!
vi: Cập nhật hồ sơ thành công!

source: Update User Profile Notification
vi: Thông báo cập nhật hồ sơ

source: Update password successfully!
vi: Cập nhật mật khẩu thành công!

source: Update password Notification
vi: Thông báo cập nhật mật khẩu

# update_password_error_title
source: Error Auth Sign In
vi: Lỗi quyền đăng nhập

# update_password_error_text
source: Let linking with Gmail's Provider to using this feature
vi: Hãy liên kết với nhà cung cấp Gmail để dùng tính năng này

source: Type Verify Password
vi: Nhập Mật Khẩu Xác Minh

source: Waiting...
vi: Đợi...

source: Type Message
vi: Nhập tin nhắn

source: Upload Image Failed
vi: Tải ảnh thất bại

source: Search
vi: Tìm kiếm

source: Recommended
vi: Gợi ý

source: Add
vi: Thêm

source: Added
vi: Đã thêm

source: Skip
vi: Bỏ qua

source: Online
vi: Hoạt động

source: Me
vi: Tôi

source: Language
vi: Ngôn ngữ

source: Vietnamese
vi: Tiếng Việt

source: English
vi: Tiếng Anh

source: viewed
vi: Đã xem

source: sent
vi: Đã gửi

# please_check_internet
source: Please check your internet connection
vi: Làm ơn kiểm tra kết nối mạng của bạn

# sent_text_image
source: sent
vi: đã gửi

source: Not sent
vi: Chưa gửi

source: ago
vi: trước

source: You
vi: Bạn

source: Refuse
vi: Từ chối

source: seconds
vi: giây

source: minutes
vi: phút

source: days
vi: ngày

source: hours
vi: giờ

source: months
vi: tháng

source: years
vi: năm

source: photo
vi: ảnh

source: Recording...
vi: Đang ghi âm...

# message_recording
source: sent an audio message
vi: đã gửi một tin nhắn âm thanh

# no_any_chat_ative
source: No any chat active
vi: Không có bất kỳ chat nào hoạt động

# request_friend_notification_title
source: Request Friend Notification
vi: Thông báo Yêu Cầu Kết Bạn

# request_friend_notification_body
source: You Have Request Friend From {friendProfile}
vi: Bạn có yêu cầu kết bạn từ {friendProfile}

# accept_friend_notification_title
source: Accept Friend Notification
vi: Thông báo chấp nhận kết bạn

# accept_friend_notification_body
source: You and {friendFullName} is friend now!
vi: Bạn và {friendFullName} bây giờ đã là bạn!

# error_length_text
source: The length of string must be greater than {lengthText}
vi: Độ dài của chuỗi phải lớn hơn {lengthText}

source: Logout
vi: Đăng xuất

source: Update Information
vi: Cập nhật thông tin

source: Update
vi: Cập nhật

source: Waiting internet
vi: Đang đợi mạng

source: Login with Google
vi: Đăng nhập Google
